          naive bayes classifier (titanic data)

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("C:\\Users\\Abhinav Mishra\\Desktop\\titanic data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace = True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
target = df.Survived
inputs =df.drop('Survived',axis = 'columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis = 'columns',inplace = True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  27.119565   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [11]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.2)

In [12]:
len(x_train)

48

In [13]:
len(x_test)

13

In [14]:
len(inputs)

61

In [15]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [16]:
model.fit(x_train,y_train)

GaussianNB()

In [17]:
model.score(x_test,y_test)

0.8461538461538461

In [18]:
x_test[:10]

    Pclass        Age     Fare  female  male
9        2  14.000000  30.0708       1     0
16       3   2.000000  29.1250       0     1
40       3  40.000000   9.4750       1     0
4        3  35.000000   8.0500       0     1
22       3  15.000000   8.0292       1     0
12       3  20.000000   8.0500       0     1
6        1  54.000000  51.8625       0     1
35       1  42.000000  52.0000       0     1
5        3  27.119565   8.4583       0     1
56       2  21.000000  10.5000       1     0

In [19]:
y_test[:10]

9     1
16    0
40    0
4     0
22    1
12    0
6     0
35    0
5     0
56    1
Name: Survived, dtype: int64

In [20]:
model.predict(x_test[:10])

array([1, 0, 1, 0, 1, 0, 0, 0, 0, 1], dtype=int64)

In [21]:
model.predict_proba(x_test[:10])

array([[0.01595672, 0.98404328],
       [0.97852269, 0.02147731],
       [0.0281289 , 0.9718711 ],
       [0.97037903, 0.02962097],
       [0.03025961, 0.96974039],
       [0.97137324, 0.02862676],
       [0.90346217, 0.09653783],
       [0.87549588, 0.12450412],
       [0.96973066, 0.03026934],
       [0.01587868, 0.98412132]])